local mt = {}
local os = os
local tostring = tostring
local string = string
local pcall = pcall
local vim = vim
local icons = require('icons')
local path_ok, plenary_path = pcall(require, "plenary.path")
local session_utils = require('session_manager.utils')
local dashboard = require("alpha.themes.dashboard")
require "alpha.term"

local has_project, project = pcall(require, "project_nvim")
local cdir = vim.fn.getcwd()
local shortcut_keynum = 0
-- local if_nil = vim.F.if_nil

-- local nvim_web_devicons = {
-- 	enabled = true,
-- 	highlight = true,
-- }



local function get_extension(fn)
	local match = fn:match("^.+(%..+)$")
	local ext = ""
	if match ~= nil then
		ext = match:sub(2)
	end
	return ext
end

local function get_icon(fn)
	local nwd = require("nvim-web-devicons")
	local ext = get_extension(fn)
	return nwd.get_icon(fn, ext, { default = true })
end

local function get_shortpath(fullpath, width)
	local shortpath = string.gsub(fullpath, vim.env.HOME, "~")
	if #shortpath > width and path_ok then
		shortpath = plenary_path.new(shortpath):shorten(1, { -2, -1 })
		if #shortpath > width then
			shortpath = plenary_path.new(shortpath):shorten(1, { -1 })
		end
	end

	return shortpath
end

local function open_project(project_path)
	local success = require("project_nvim.project").set_pwd(project_path, "alpha")
	if not success then
		return
	end
	require("telescope.builtin").find_files {
		cwd = project_path,
	}
end

local function create_projects(start, target_width)
	if start == nil then
		start = 1
	end
	if target_width == nil then
		target_width = 70
	end
	if not has_project then
		return require("alpha.themes.theta").mru(start, vim.fn.getcwd())
	end
	local buttons = {}
	local project_paths = project.get_recent_projects()
	local added_projects = 0
	-- most recent project is the last
	for i = 1, #project_paths do
		if added_projects == 9 then
			break
		end
		local project_path = project_paths[i]
		local stat = vim.loop.fs_stat(project_path .. "/.git")
		if stat ~= nil and stat.type == "directory" then
			added_projects = added_projects + 1
			shortcut_keynum = shortcut_keynum + 1
			local shortcut = tostring(shortcut_keynum)
			local display_path = "  " .. get_shortpath(project_path, target_width)
			buttons[added_projects] = {
				type = "button",
				val = display_path,
				on_press = function()
					open_project(project_path)
				end,
				opts = {
					position = "center",
					shortcut = shortcut,
					-- 光标位置
					-- cursor = target_width,
					cursor = 5,
					width = target_width,
					align_shortcut = "right",
					hl_shortcut = "Keyword",
					-- 高亮位置
					hl = { { "Number", 1, 3 } },
					keymap = {
						"n",
						shortcut,
						"<cmd>lua require('config.alpha-nvim').open_project('" ..
						string.gsub(project_path, '\\', '\\\\') .. "')<CR>",
						{ noremap = true, silent = true, nowait = true },
					},
				},
			}
		end
	end
	return buttons
end

local function create_sessions(start, target_width)
	if start == nil then
		start = 1
	end
	if target_width == nil then
		target_width = 70
	end

	local sessions = session_utils.get_sessions()
	if not sessions then
		return require("alpha.themes.theta").mru(start, cdir)
	end
	local buttons = {}
	local added = 0
	shortcut_keynum = 0;
	-- most recent project is the last
	for i = 1, #sessions do
		if added == 12 then
			break
		end
		local s = sessions[i]
		added = added + 1
		shortcut_keynum = shortcut_keynum + 1
		local shortcut = tostring(shortcut_keynum)
		local display_path = "  " .. get_shortpath(s.dir.filename, target_width)
		buttons[added] = {
			type = "button",
			val = display_path,
			on_press = function()
				session_utils.load_session(s.filename)
			end,
			opts = {
				position = "center",
				shortcut = shortcut,
				-- 光标位置
				-- cursor = target_width,
				cursor = 5,
				width = target_width,
				align_shortcut = "right",
				hl_shortcut = "Keyword",
				-- 高亮位置
				hl = { { "Number", 1, 3 } },
				keymap = {
					"n",
					shortcut,
					"<cmd>lua require('session_manager.utils').load_session('" ..
					string.gsub(s.filename, '\\', '\\\\') .. "')<CR>",
					{ noremap = true, silent = true, nowait = true },
				},
			},
		}
	end
	return buttons
end

local function create_shortcut(icon, sc, txt, keybind)
	local button = dashboard.button(sc, txt, keybind)
	button.opts.cursor = 5
	button.opts.hl = { { "Number", 1, 3 } }
	button.opts.width = 30
	return button
end

-- local sessions = session_utils.get_sessions()
-- for k, v in pairs(sessions) do
-- 	for k1, v1 in pairs(v) do
-- 		print(k, k1, v1)
-- 	end
-- end

-- dashboard.section.header.val = {
--     "                                   ",
--     "                                   ",
--     "                                   ",
--     "                                   ",
--     " ⢸⣿⣿⣿⣿⠃⠄⢀⣴⡾⠃⠄⠄⠄⠄⠄⠈⠺⠟⠛⠛⠛⠛⠻⢿⣿⣿⣿⣿⣶⣤⡀⠄ ",
--     " ⢸⣿⣿⣿⡟⢀⣴⣿⡿⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣸⣿⣿⣿⣿⣿⣿⣿⣷ ",
--     " ⢸⣿⣿⠟⣴⣿⡿⡟⡼⢹⣷⢲⡶⣖⣾⣶⢄⠄⠄⠄⠄⠄⢀⣼⣿⢿⣿⣿⣿⣿⣿⣿⣿ ",
--     " ⢸⣿⢫⣾⣿⡟⣾⡸⢠⡿⢳⡿⠍⣼⣿⢏⣿⣷⢄⡀⠄⢠⣾⢻⣿⣸⣿⣿⣿⣿⣿⣿⣿ ",
--     " ⡿⣡⣿⣿⡟⡼⡁⠁⣰⠂⡾⠉⢨⣿⠃⣿⡿⠍⣾⣟⢤⣿⢇⣿⢇⣿⣿⢿⣿⣿⣿⣿⣿ ",
--     " ⣱⣿⣿⡟⡐⣰⣧⡷⣿⣴⣧⣤⣼⣯⢸⡿⠁⣰⠟⢀⣼⠏⣲⠏⢸⣿⡟⣿⣿⣿⣿⣿⣿ ",
--     " ⣿⣿⡟⠁⠄⠟⣁⠄⢡⣿⣿⣿⣿⣿⣿⣦⣼⢟⢀⡼⠃⡹⠃⡀⢸⡿⢸⣿⣿⣿⣿⣿⡟ ",
--     " ⣿⣿⠃⠄⢀⣾⠋⠓⢰⣿⣿⣿⣿⣿⣿⠿⣿⣿⣾⣅⢔⣕⡇⡇⡼⢁⣿⣿⣿⣿⣿⣿⢣ ",
--     " ⣿⡟⠄⠄⣾⣇⠷⣢⣿⣿⣿⣿⣿⣿⣿⣭⣀⡈⠙⢿⣿⣿⡇⡧⢁⣾⣿⣿⣿⣿⣿⢏⣾ ",
--     " ⣿⡇⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⢻⠇⠄⠄⢿⣿⡇⢡⣾⣿⣿⣿⣿⣿⣏⣼⣿ ",
--     " ⣿⣷⢰⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⢰⣧⣀⡄⢀⠘⡿⣰⣿⣿⣿⣿⣿⣿⠟⣼⣿⣿ ",
--     " ⢹⣿⢸⣿⣿⠟⠻⢿⣿⣿⣿⣿⣿⣿⣿⣶⣭⣉⣤⣿⢈⣼⣿⣿⣿⣿⣿⣿⠏⣾⣹⣿⣿ ",
--     " ⢸⠇⡜⣿⡟⠄⠄⠄⠈⠙⣿⣿⣿⣿⣿⣿⣿⣿⠟⣱⣻⣿⣿⣿⣿⣿⠟⠁⢳⠃⣿⣿⣿ ",
--     " ⠄⣰⡗⠹⣿⣄⠄⠄⠄⢀⣿⣿⣿⣿⣿⣿⠟⣅⣥⣿⣿⣿⣿⠿⠋⠄⠄⣾⡌⢠⣿⡿⠃ ",
--     " ⠜⠋⢠⣷⢻⣿⣿⣶⣾⣿⣿⣿⣿⠿⣛⣥⣾⣿⠿⠟⠛⠉            ",
--     "                                   ",
--     "                                   ",
--     "    ~ brain.exist() == null; ~    ",
--     "                                   ",
--
-- }
--


-- dashboard.section.header.val = {
-- 			"                                   ",
-- 			"          ▀████▀▄▄              ▄█ ",
-- 			"            █▀    ▀▀▄▄▄▄▄    ▄▄▀▀█ ",
-- 			"    ▄        █          ▀▀▀▀▄  ▄▀  ",
-- 			"   ▄▀ ▀▄      ▀▄              ▀▄▀  ",
-- 			"  ▄▀    █     █▀   ▄█▀▄      ▄█    ",
-- 			"  ▀▄     ▀▄  █     ▀██▀     ██▄█   ",
-- 			"   ▀▄    ▄▀ █   ▄██▄   ▄  ▄  ▀▀ █  ",
-- 			"    █  ▄▀  █    ▀██▀    ▀▀ ▀▀  ▄▀  ",
-- 			"   █   █  █      ▄▄           ▄▀   ",
-- 			"                                   ",
-- }
--
local function header_hl_today()
	local wday = os.date("*t").wday
	local colors = { "Keyword", "Constant", "Number", "Type", "String", "Special", "Function" }
	return colors[wday]
end

local section_header = {
	type = "text",
	val = {
		-- ⠄⠄⠄⢸⣼⣿⣵⣦⣿⣿⣮⣶⣤⣄⣐⣨⣛⣲⣶⣤⣤⣠⣄⣀⢀⣀⣀⣀
		-- ⠄⠄⠄⣼⡟⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⡝⠉⠉⠉⠛⢿⣿⣿⣽⣀⣻⠾⠚
		-- ⠄⠄⠄⣯⠁⢠⣌⡻⣯⣿⣿⣿⣿⣿⣿⣣⠄⢸⣿⣷⣦⡈⢻⣿⡇⠄⠄⠄
		-- ⠄⠄⠄⢸⣸⠰⣿⣿⣼⣿⣿⣿⣿⣿⣿⣿⠄⠘⣿⣿⣿⣿⣴⣿⡇⠄⠄⠄
		-- ⠄⠄⠄⢸⣿⣆⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠼⢿⣿⣿⣿⣿⣿⠇⠊⠄⠄
		-- ⠄⠄⠄⢸⣿⣷⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠁⠄⠄⠄
		-- ⠄⠄⠄⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠋⠁⠄⠄⠄⠄⠄
		-- ⠄⠄⠄⢣⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣿⠎⠄⠄⠄⠄⠄⠄
		-- ⠄⠄⠄⠈⢿⣿⣿⡿⠿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠄⠄⠄⠄⠄⠄⠄
		-- ⠄⠄⠄⠄⠄⠙⠃⣀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣀⣤⣢⡴⣿⣰⡇⠄
		-- ⣿⡆⠄⠈⠄⠄⠄⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠿⠛⣡⣾⣿⣿⡆⠄
		--
		--❤️⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀❤️
		-- ⠀⠀⠀⠀⠀⠀❤️❤️⠀⠀⠀⠀⠀⠀❤️❤️⠀⠀
		-- ⠀⠀⠀⠀⠀❤️⠀⠀⠀❤️⠀⠀❤️⠀⠀⠀❤️
		-- ⠀⠀⠀⠀⠀❤️⠀⠀⠀⠀⠀❤️⠀⠀⠀⠀⠀❤️
		-- ⠀⠀⠀⠀⠀⠀❤️⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀❤️
		-- ⠀⠀⠀⠀⠀⠀⠀⠀❤️⠀⠀⠀⠀⠀⠀❤️
		-- ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀❤️⠀⠀❤️
		-- ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀❤️
		--
		-- ⠀⠀⠀⠀⠀⠀⠀❤️⠀ MEOW ⠀❤️
		--
		-- ⣿⣿⣿⣿⡟⣙⡛⢿⣿⣿⣿⣿⣿⣿⣿⣿⢟⣛⢻
		-- ⣿⣿⣿⣿⢰⣿⣿⣌⣍⠄⣆⠄⡆⢀⣙⣡⣿⣿⢸⣿
		-- ⣿⣿⣿⡟⢸⣿⣿⣿⣿⣾⣿⣾⣿⣾⣿⣿⣿⠏⣾⣿
		-- ⣿⣿⠏⣴⣿⣿⣿⠛⠛⣿⣿⣿⣿⡿⠛⠻⣿⣴⡌⡿⣿
		-- ⣟⣛⢈⣹⣿⣿⣿⣦⣥⣿⢯⠉⣿⣷⣬⣴⣿⣯⡲⠸⠿⢶
		-- ⣯⣿⢰⣾⣿⣿⣿⣿⣿⣿⣷⣶⣾⣿⣿⣿⣿⣿⣿⡏⣿
		-- ⣿⡿⣸⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⡇⣿
		-- ⣿⢡⣿⣿⣿⣿⣌⠻⣿⣿⣿⣿⣿⣿⠟⣡⣾⣿⣿⠇⠹⣿⣿⡿⠛⢛⠻⣿
		-- ⣟⣀⣬⣿⣦⣝⠛⢃⣼⣿⣿⣿⣿⣿⣘⢛⣫⣴⣿⠦⠄⢻⣿⢰⣦⣼⣷⢸
		-- ⡏⠉⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⢸⣿⡘⣿⡄⣶⣾
		-- ⡟⠛⠛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣦⡀⢸⣿⢃⣿⣧⢸
		-- ⣧⢠⣾⣿⣿⣏⣛⡻⢿⣿⣿⣿⣿⠿⣋⣴⣿⣿⣿⣿⣧⣭⡴⣿⡋⠋⣼
		-- ⣿⣦⡙⢿⡿⠿⢿⣿⠆⣿⣿⣿⣿⠸⡿⠟⡋⠼⢛⣛⣛⣛⣃⣬⣴⣾⣿
		-- ⣿⣿⣿⣶⣾⣭⣤⣤⣬⣭⣭⣭⣭⣥⣤⣵⣶⣿⣿
		-- ░░░░░░░█▐▓▓░████▄▄▄█▀▄▓▓▓▌█
		-- ░░░░░▄█▌▀▄▓▓▄▄▄▄▀▀▀▄▓▓▓▓▓▌█
		-- ░░░▄█▀▀▄▓█▓▓▓▓▓▓▓▓▓▓▓▓▀░▓▌█
		-- ░░█▀▄▓▓▓███▓▓▓███▓▓▓▄░░▄▓▐█▌
		-- ░█▌▓▓▓▀▀▓▓▓▓███▓▓▓▓▓▓▓▄▀▓▓▐█
		-- ▐█▐██▐░▄▓▓▓▓▓▀▄░▀▓▓▓▓▓▓▓▓▓▌█▌
		-- █▌███▓▓▓▓▓▓▓▓▐░░▄▓▓███▓▓▓▄▀▐█
		-- █▐█▓▀░░▀▓▓▓▓▓▓▓▓▓██████▓▓▓▓▐█
		-- ▌▓▄▌▀░▀░▐▀█▄▓▓██████████▓▓▓▌█▌
		-- ▌▓▓▓▄▄▀▀▓▓▓▀▓▓▓▓▓▓▓▓█▓█▓█▓▓▌█▌
		-- █▐▓▓▓▓▓▓▄▄▄▓▓▓▓▓▓█▓█▓█▓█▓▓▓▐█
		--
		-- ░▀█░█████████████████▀▀░░░██░████
		-- ▄▄█████████████████▀░░░░░░██░████
		-- ███▀▀████████████▀░░░░░░░▄█░░████
		-- ███▄░░░░▀▀█████▀░▄▀▄░░░░▄█░░▄████
		-- ░███▄▄░░▄▀▄░▀███▄▀▀░░▄▄▀█▀░░█████
		-- ▄▄█▄▀█▄▄░▀▀████████▀███░░▄░██████
		-- ▀████▄▀▀▀██▀▀██▀▀██░░▀█░░█▄█████░
		-- ░░▀▀███▄░▀█░░▀█░░░▀░█░░░▄██████░▄
		-- ████▄▄▀██▄
		--
		--
		--
		--
		--
		-- ███╗   ██╗██╗███████╗██████╗ ██╗   ██╗██╗███╗   ███╗
		-- ████╗  ██║██║██╔════╝██╔══██╗██║   ██║██║████╗ ████║
		-- ██╔██╗ ██║██║█████╗  ██████╔╝██║   ██║██║██╔████╔██║
		-- ██║╚██╗██║██║██╔══╝  ██╔══██╗╚██╗ ██╔╝██║██║╚██╔╝██║
		-- ██║ ╚████║██║███████╗██║  ██║ ╚████╔╝ ██║██║ ╚═╝ ██║
		-- ╚═╝  ╚═══╝╚═╝╚══════╝╚═╝  ╚═╝  ╚═══╝  ╚═╝╚═╝     ╚═╝
		--
		--
		--
		-- [[ ███▄▄▄▄    ▄█     ▄████████    ▄████████  ▄█    █▄   ▄█     ▄▄▄▄███▄▄▄▄   ]],
		-- [[ ███▀▀▀██▄ ███    ███    ███   ███    ███ ███    ███ ███   ▄██▀▀▀███▀▀▀██▄ ]],
		-- [[ ███   ███ ███▌   ███    █▀    ███    ███ ███    ███ ███▌  ███   ███   ███ ]],
		-- [[ ███   ███ ███▌  ▄███▄▄▄      ▄███▄▄▄▄██▀ ███    ███ ███▌  ███   ███   ███ ]],
		-- [[ ███   ███ ███▌ ▀▀███▀▀▀     ▀▀███▀▀▀▀▀   ███    ███ ███▌  ███   ███   ███ ]],
		-- [[ ███   ███ ███    ███    █▄  ▀███████████ ███    ███ ███   ███   ███   ███ ]],
		-- [[ ███   ███ ███    ███    ███   ███    ███ ███    ███ ███   ███   ███   ███ ]],
		-- [[  ▀█   █▀  █▀     ██████████   ███    ███  ▀██████▀  █▀     ▀█   ███   █▀  ]],
		-- [[                               ███    ███                                  ]],

		-- [[	      ::::    :::  :::::::::::  ::::::::::  :::::::::    :::     :::  :::::::::::    :::   ::: ]],
		-- [[	     :+:+:   :+:      :+       :+:         :+:    :+:   :+:     :+:      :+:       :+:+: :+:+: ]],
		-- [[	    :+:+:+  +:+      +:+      +:+         +:+    +:+   +:+     +:+      +:+      +:+ +:+:+ +:+ ]],
		-- [[	   +#+ +:+ +#+      +#+      +#++:++#    +#++:++#:    +#+     +:+      +#+      +#+  +:+  +#+  ]],
		-- [[	  +#+  +#+#+#      +#+      +#+         +#+    +#+    +#+   +#+       +#+      +#+       +#+   ]],
		-- [[	 #+#   #+#+#      #+#      #+#         #+#    #+#     #+#+#+#        #+#      #+#       #+#    ]],
		-- [[	###    ####  ###########  ##########  ###    ###       ###      ###########  ###       ###     ]],

		-- [[                                                                                                    ]],
		-- [[⠄⠄⠄..⢠⣿⣿⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⣿⣆⠄.⠄⠄                                                                       ]],
		-- [[⠄⠄⠄⠄⢠⣿⣿⣿⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⣿⣿⣆⠄⠄⠄                                                                       ]],
		-- [[⠄⠄⣼⢀⣿⣿⣿⣿⣏⡏⠄⠹⣿⣿⣿⣿⣿⣿⣿⣿⣧⢻⣿⣿⣿⣿⡆⠄⠄  ██████   █████                   █████   █████  ███                  ]],
		-- [[⠄⠄⡟⣼⣿⣿⣿⣿⣿⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿⣿⣇⢻⣿⣿⣿⣿⠄⠄ ░░██████ ░░███                   ░░███   ░░███  ░░░                   ]],
		-- [[⠄⢰⠃⣿⣿⠿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠙⠿⣿⣿⣿⣿⣿⠄⢿⣿⣿⣿⡄⠄  ░███░███ ░███   ██████   ██████  ░███    ░███  ████  █████████████   ]],
		-- [[⠄⢸⢠⣿⣿⣧⡙⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄⠈⠛⢿⣿⣿⡇⠸⣿⡿⣸⡇⠄  ░███░░███░███  ███░░███ ███░░███ ░███    ░███ ░░███ ░░███░░███░░███  ]],
		-- [[⠄⠈⡆⣿⣿⣿⣿⣦⡙⠳⠄⠄⠄⠄⠄⠄⢀⣠⣤⣀⣈⠙⠃⠄⠿⢇⣿⡇⠄  ░███ ░░██████ ░███████ ░███ ░███ ░░███   ███   ░███  ░███ ░███ ░███  ]],
		-- [[⠄⠄⡇⢿⣿⣿⣿⣿⡇⠄⠄⠄⠄⠄⣠⣶⣿⣿⣿⣿⣿⣿⣷⣆⡀⣼⣿⡇⠄  ░███  ░░█████ ░███░░░  ░███ ░███  ░░░█████░    ░███  ░███ ░███ ░███  ]],
		-- [[⠄⠄⢹⡘⣿⣿⣿⢿⣷⡀⠄⢀⣴⣾⣟⠉⠉⠉⠉⣽⣿⣿⣿⣿⠇⢹⣿⠃⠄  █████  ░░█████░░██████ ░░██████     ░░███      █████ █████░███ █████ ]],
		-- [[⠄⠄⠄⢷⡘⢿⣿⣎⢻⣷⠰⣿⣿⣿⣿⣦⣀⣀⣴⣿⣿⣿⠟⢫⡾⢸⡟⠄⠄ ░░░░░    ░░░░░  ░░░░░░   ░░░░░░       ░░░      ░░░░░ ░░░░░ ░░░ ░░░░░  ]],
		-- [[⠄⠄⠄⠄⠻⣦⡙⠿⣧⠙⢷⠙⠻⠿⢿⡿⠿⠿⠛⠋⠉⠄⠂⠘⠁⠞⠄⠄⠄                                                                       ]],
		-- [[⠄⠄⠄⠄⠄⠈⠙⠑⣠⣤⣴⡖⠄⠿⣋⣉⣉⡁⠄⢾⣦⠄⠄⠄⠄⠄⠄⠄⠄                                                                       ]],
		-- [[                                                                                                    ]],


		[[                                                                                                  ]],
		[[                                                                                                  ]],
		[[   ⠄⢠⣿⣿⣿⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⣿⣿⣆                                                                        ]],
		[[  ⣼⢀⣿⣿⣿⣿⣏⡏ ⠹⣿⣿⣿⣿⣿⣿⣿⣿⣧⢻⣿⣿⣿⣿⡆  ███╗     ██╗██╗█████████╗█████████╗     ██╗      ██╗██╗██╗       ██╗ ]],
		[[  ⡟⣼⣿⣿⣿⣿⣿   ⠈⠻⣿⣿⣿⣿⣿⣿⣿⣇⢻⣿⣿⣿⣿  ████╗    ██║██║██╔══════╝██╔═════██╗    ██║      ██║██║███╗     ███║ ]],
		[[ ⢰⠃⣿⣿⠿⣿⣿⣿      ⠙⠿⣿⣿⣿⣿⣿⠄⢿⣿⣿⣿⡄ ██╔██╗   ██║██║██║       ██║     ██║    ██║      ██║██║████╗   ████║ ]],
		[[ ⢸⢠⣿⣿⣧⡙⣿⣿⡆       ⠈⠛⢿⣿⣿⡇⠸⣿⡿⣸⡇ ██║╚██╗  ██║██║███████╗  █████████╔╝    ██║      ██║██║██╔██╗ ██╔██║ ]],
		[[ ⠈⡆⣿⣿⣿⣿⣦⡙⠳      ⢀⣠⣤⣀⣈⠙⠃⠄⠿⢇⣿⡇ ██║ ╚██╗ ██║██║██╔════╝  ██╔═════██╗    ╚██╗    ██╔╝██║██║╚████╔╝██║ ]],
		[[  ⡇⢿⣿⣿⣿⣿⡇     ⣠⣶⣿⣿⣿⣿⣿⣿⣷⣆⡀⣼⣿⡇ ██║  ╚██╗██║██║██║       ██║     ██║     ╚██╗  ██╔╝ ██║██║ ╚██╔╝ ██║ ]],
		[[  ⢹⡘⣿⣿⣿⢿⣷⡀ ⢀⣴⣾⣟⠉⠉⠉⠉⣽⣿⣿⣿⣿⠇⢹⣿⠃ ██║   ╚████║██║█████████╗██║     ██║      ╚█████╔╝  ██║██║  ╚═╝  ██║ ]],
		[[   ⢷⡘⢿⣿⣎⢻⣷⠰⣿⣿⣿⣿⣦⣀⣀⣴⣿⣿⣿⠟⢫⡾⢸⡟  ╚═╝    ╚═══╝╚═╝╚════════╝╚═╝     ╚═╝       ╚════╝   ╚═╝╚═╝       ╚═╝ ]],
		[[     ⠻⣦⡙⠿⣧⠙⢷⠙⠻⠿⢿⡿⠿⠿⠛⠋⠉⠄⠂⠘⠁⠞                                                                       ]],
		[[      ⠈⠙⠑⣠⣤⣴⡖⠄⠿⣋⣉⣉⡁⠄⢾⣦⠄                                                                           ]],
		[[                                                                                                  ]],
		[[                                                                                                  ]],

		-- [[                                                                                                    ]],
		-- [[    ⠄⢠⣿⣿⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⣿⣆                                                                           ]],
		-- [[   ⠄⢠⣿⣿⣿⣿⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⣿⣿⣆                                                                          ]],
		-- [[  ⣼⢀⣿⣿⣿⣿⣏⡏ ⠹⣿⣿⣿⣿⣿⣿⣿⣿⣧⢻⣿⣿⣿⣿⡆    ██████   █████                   █████   █████  ███                  ]],
		-- [[  ⡟⣼⣿⣿⣿⣿⣿   ⠈⠻⣿⣿⣿⣿⣿⣿⣿⣇⢻⣿⣿⣿⣿   ░░██████ ░░███                   ░░███   ░░███  ░░░                   ]],
		-- [[ ⢰⠃⣿⣿⠿⣿⣿⣿      ⠙⠿⣿⣿⣿⣿⣿⠄⢿⣿⣿⣿⡄   ░███░███ ░███   ██████   ██████  ░███    ░███  ████  █████████████   ]],
		-- [[ ⢸⢠⣿⣿⣧⡙⣿⣿⡆       ⠈⠛⢿⣿⣿⡇⠸⣿⡿⣸⡇   ░███░░███░███  ███░░███ ███░░███ ░███    ░███ ░░███ ░░███░░███░░███  ]],
		-- [[ ⠈⡆⣿⣿⣿⣿⣦⡙⠳      ⢀⣠⣤⣀⣈⠙⠃⠄⠿⢇⣿⡇   ░███ ░░██████ ░███████ ░███ ░███ ░░███   ███   ░███  ░███ ░███ ░███  ]],
		-- [[  ⡇⢿⣿⣿⣿⣿⡇     ⣠⣶⣿⣿⣿⣿⣿⣿⣷⣆⡀⣼⣿⡇   ░███  ░░█████ ░███░░░  ░███ ░███  ░░░█████░    ░███  ░███ ░███ ░███  ]],
		-- [[  ⢹⡘⣿⣿⣿⢿⣷⡀ ⢀⣴⣾⣟⠉⠉⠉⠉⣽⣿⣿⣿⣿⠇⢹⣿⠃   █████  ░░█████░░██████ ░░██████     ░░███      █████ █████░███ █████ ]],
		-- [[   ⢷⡘⢿⣿⣎⢻⣷⠰⣿⣿⣿⣿⣦⣀⣀⣴⣿⣿⣿⠟⢫⡾⢸⡟   ░░░░░    ░░░░░  ░░░░░░   ░░░░░░       ░░░      ░░░░░ ░░░░░ ░░░ ░░░░░  ]],
		-- [[    ⠻⣦⡙⠿⣧⠙⢷⠙⠻⠿⢿⡿⠿⠿⠛⠋⠉⠄⠂⠘⠁⠞                                                                          ]],
		-- [[     ⠈⠙⠑⣠⣤⣴⡖⠄⠿⣋⣉⣉⡁⠄⢾⣦⠄                                                                              ]],
		-- [[                                                                                                    ]],

		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣵⠾⠟⠛⠛⠛⠿⠿⣿⣿⣿⣷⣮⣻⢿⣿⣿⣿⣿⣿⣿⣿⣿⠿⣿⡿⢿⠿⠿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⢿⣿⣿⢿⣿⣿⡿⣿⣿⡿⣿⣿⡿⣿⡿⣭⠎⠋⠀⢀⣀⣤⣄⣀⠀⠀⠀⠉⠻⢿⣿⣿⣷⣽⠿⣿⣿⡿⣿⣿⡿⣷⣷⡶⢾⣶⣶⢿⠀⠀ ]],
		-- [[ ⠀⠀⢰⣿⣿⣷⣿⣿⣿⣾⣿⣿⣿⣿⣿⣾⣿⣟⡾⢁⣴⣾⣿⣿⣿⣿⣿⣿⣿⣶⣄⡀⠀⠀⠘⣿⣿⣽⣷⣽⣾⣿⣿⣾⣿⣿⣾⣿⣿⣷⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣣⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⣿⣿⣿⡝⣿⡞⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⢸⣿⣿⣿⠻⣿⣦⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⣿⣿⣿⠛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⣿⣿⣿⡇⢸⣿⣆⢻⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⣿⣿⣿⡟⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣾⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⣿⣿⣿⡇⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣿⣿⣸⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⣿⣿⣿⡇⠀⠀⠀⠀⠻⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢰⠀⣿⣧⢻⣧⠀⢠⣶⣿⣽⣿⣮⣧⣝⢿⣿⢿⣿⣿⣿⣿⣿⣿⣿⡟⡏⡿⣾⢹⢻⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣘⠆⣿⣿⣷⡝⠦⡀⣿⣿⣝⣯⣿⣿⣿⣷⡟⣶⢻⣿⣿⣿⣿⣿⣿⠀⣿⣇⡿⠸⢸⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣪⡸⢹⣿⣧⠀⢊⢿⣿⢟⣛⣿⡿⣿⣿⣿⣼⣸⣿⣿⣿⣿⣿⠃⠀⠅⣟⠝⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢷⡅⢻⣷⠢⡀⠘⣿⣯⣭⣿⣿⣿⣿⡿⢟⣿⡟⣾⣿⡿⠃⠀⠘⠈⠠⣂⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⢨⣳⢄⠻⡆⠄⠐⠈⠻⢿⣿⡿⠟⠋⠀⠁⠋⠸⠋⠉⠀⣠⢇⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣸⣷⣿⣷⣯⡸⢦⡀⢢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣾⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢉⢩⣩⣷⣾⣿⣿⣷⣎⡹⣿⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠛⠛⠛⠛⠛⠛⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⢻⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡘⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠠⣄⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⢀⠠⠐⠖⠁⠘⡀⠻⠉⠁⡀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⣿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠐⠋⠘⠃⢀⣠⣤⣄⣀⡀⠈⠉⠛⠛⠂⠀⠀⠀⠀⠘⣿⣿⣿⣿⡿⠿⠿⠛⠛⠛⠛⠀⢿⣿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠛⠛⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠟⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣿⠀⠀ ]],
		-- [[ ⠀⠀⢨⣿⣿⣯⣾⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⠀⠀ ]],
		-- [[ ⠀⠀⢸⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣴⣿⣿⣿⠀⠀ ]],
	},
	opts = {
		position = "center",
		hl = header_hl_today(),
		-- wrap = "overflow";
	},
}

vim.api.nvim_set_hl(0, "I2A0", { fg = "#000000" })
vim.api.nvim_set_hl(0, "I2A1", { fg = "#646156" })
vim.api.nvim_set_hl(0, "I2A2", { fg = "#c7c1ac" })
vim.api.nvim_set_hl(0, "I2A3", { fg = "#bab5a8" })
vim.api.nvim_set_hl(0, "I2A4", { fg = "#9fa9ac" })
vim.api.nvim_set_hl(0, "I2A5", { fg = "#c1c7c6" })
vim.api.nvim_set_hl(0, "I2A6", { fg = "#898684" })
vim.api.nvim_set_hl(0, "I2A7", { fg = "#5b5a58" })
vim.api.nvim_set_hl(0, "I2A8", { fg = "#bcbdbb" })
vim.api.nvim_set_hl(0, "I2A9", { fg = "#ccdadc" })
vim.api.nvim_set_hl(0, "I2A10", { fg = "#c1c4c2" })
vim.api.nvim_set_hl(0, "I2A11", { fg = "#8f8783" })
vim.api.nvim_set_hl(0, "I2A12", { fg = "#9c9788" })
vim.api.nvim_set_hl(0, "I2A13", { fg = "#8f8987" })
vim.api.nvim_set_hl(0, "I2A14", { fg = "#686260" })
vim.api.nvim_set_hl(0, "I2A15", { fg = "#232322" })
vim.api.nvim_set_hl(0, "I2A16", { fg = "#15161a" })
vim.api.nvim_set_hl(0, "I2A17", { fg = "#26262d" })
vim.api.nvim_set_hl(0, "I2A18", { fg = "#706f72" })
vim.api.nvim_set_hl(0, "I2A19", { fg = "#434246" })
vim.api.nvim_set_hl(0, "I2A20", { fg = "#1b1b20" })
vim.api.nvim_set_hl(0, "I2A21", { fg = "#202026" })
vim.api.nvim_set_hl(0, "I2A22", { fg = "#2a2b33" })
vim.api.nvim_set_hl(0, "I2A23", { fg = "#323237" })
vim.api.nvim_set_hl(0, "I2A24", { fg = "#898480" })
vim.api.nvim_set_hl(0, "I2A25", { fg = "#bcb0a8" })
vim.api.nvim_set_hl(0, "I2A26", { fg = "#d8e3e4" })
vim.api.nvim_set_hl(0, "I2A27", { fg = "#c7cecd" })
vim.api.nvim_set_hl(0, "I2A28", { fg = "#b6a8a0" })
vim.api.nvim_set_hl(0, "I2A29", { fg = "#9a928b" })
vim.api.nvim_set_hl(0, "I2A30", { fg = "#a09c8e" })
vim.api.nvim_set_hl(0, "I2A31", { fg = "#a09e9b" })
vim.api.nvim_set_hl(0, "I2A32", { fg = "#c2c2bf" })
vim.api.nvim_set_hl(0, "I2A33", { fg = "#f0f4f5" })
vim.api.nvim_set_hl(0, "I2A34", { fg = "#b6b3b0" })
vim.api.nvim_set_hl(0, "I2A35", { fg = "#e4eced" })
vim.api.nvim_set_hl(0, "I2A36", { fg = "#fcfdfd" })
vim.api.nvim_set_hl(0, "I2A37", { fg = "#c8c6c3" })
vim.api.nvim_set_hl(0, "I2A38", { fg = "#383839" })
vim.api.nvim_set_hl(0, "I2A39", { fg = "#333737" })
vim.api.nvim_set_hl(0, "I2A40", { fg = "#a5a09d" })
vim.api.nvim_set_hl(0, "I2A41", { fg = "#999289" })
vim.api.nvim_set_hl(0, "I2A42", { fg = "#b4b0a4" })
vim.api.nvim_set_hl(0, "I2A43", { fg = "#bcb5af" })
vim.api.nvim_set_hl(0, "I2A44", { fg = "#616363" })
vim.api.nvim_set_hl(0, "I2A45", { fg = "#c1c1be" })
vim.api.nvim_set_hl(0, "I2A46", { fg = "#d9d8d7" })
vim.api.nvim_set_hl(0, "I2A47", { fg = "#f1efee" })
vim.api.nvim_set_hl(0, "I2A48", { fg = "#d3d9d9" })
vim.api.nvim_set_hl(0, "I2A49", { fg = "#ebebea" })
vim.api.nvim_set_hl(0, "I2A50", { fg = "#939191" })
vim.api.nvim_set_hl(0, "I2A51", { fg = "#8f8b8a" })
vim.api.nvim_set_hl(0, "I2A52", { fg = "#aaa49d" })
vim.api.nvim_set_hl(0, "I2A53", { fg = "#8f8683" })
vim.api.nvim_set_hl(0, "I2A54", { fg = "#2e2d2c" })
vim.api.nvim_set_hl(0, "I2A55", { fg = "#7e7f7f" })
vim.api.nvim_set_hl(0, "I2A56", { fg = "#9b9390" })
vim.api.nvim_set_hl(0, "I2A57", { fg = "#9b9694" })
vim.api.nvim_set_hl(0, "I2A58", { fg = "#9d988c" })
vim.api.nvim_set_hl(0, "I2A59", { fg = "#8b8482" })
vim.api.nvim_set_hl(0, "I2A60", { fg = "#615c58" })
vim.api.nvim_set_hl(0, "I2A61", { fg = "#cdcfce" })
vim.api.nvim_set_hl(0, "I2A62", { fg = "#b6b6b7" })
vim.api.nvim_set_hl(0, "I2A63", { fg = "#958d8c" })
vim.api.nvim_set_hl(0, "I2A64", { fg = "#807e80" })
vim.api.nvim_set_hl(0, "I2A65", { fg = "#a8a398" })
vim.api.nvim_set_hl(0, "I2A66", { fg = "#b7bcbc" })
vim.api.nvim_set_hl(0, "I2A67", { fg = "#cdd0ce" })
vim.api.nvim_set_hl(0, "I2A68", { fg = "#89817c" })
vim.api.nvim_set_hl(0, "I2A69", { fg = "#727676" })
vim.api.nvim_set_hl(0, "I2A70", { fg = "#dfe2e2" })
vim.api.nvim_set_hl(0, "I2A71", { fg = "#c7d0d1" })
vim.api.nvim_set_hl(0, "I2A72", { fg = "#897f7b" })
vim.api.nvim_set_hl(0, "I2A73", { fg = "#aca19a" })
vim.api.nvim_set_hl(0, "I2A74", { fg = "#a29995" })
vim.api.nvim_set_hl(0, "I2A75", { fg = "#928b81" })
vim.api.nvim_set_hl(0, "I2A76", { fg = "#5c5556" })
vim.api.nvim_set_hl(0, "I2A77", { fg = "#5b5450" })
vim.api.nvim_set_hl(0, "I2A78", { fg = "#9d9a92" })
vim.api.nvim_set_hl(0, "I2A79", { fg = "#938c86" })
vim.api.nvim_set_hl(0, "I2A80", { fg = "#3b3638" })
vim.api.nvim_set_hl(0, "I2A81", { fg = "#adb2b3" })
vim.api.nvim_set_hl(0, "I2A82", { fg = "#0b0b0d" })
vim.api.nvim_set_hl(0, "I2A83", { fg = "#99a4a5" })
vim.api.nvim_set_hl(0, "I2A84", { fg = "#d3d4d2" })
vim.api.nvim_set_hl(0, "I2A85", { fg = "#cecac7" })
vim.api.nvim_set_hl(0, "I2A86", { fg = "#cdd5d5" })
vim.api.nvim_set_hl(0, "I2A87", { fg = "#aca79f" })
vim.api.nvim_set_hl(0, "I2A88", { fg = "#c3bba9" })
vim.api.nvim_set_hl(0, "I2A89", { fg = "#686565" })
vim.api.nvim_set_hl(0, "I2A90", { fg = "#8d8a89" })
vim.api.nvim_set_hl(0, "I2A91", { fg = "#8e8d8b" })
vim.api.nvim_set_hl(0, "I2A92", { fg = "#94928f" })
vim.api.nvim_set_hl(0, "I2A93", { fg = "#4a4144" })
vim.api.nvim_set_hl(0, "I2A94", { fg = "#c5a19b" })
vim.api.nvim_set_hl(0, "I2A95", { fg = "#a48581" })
vim.api.nvim_set_hl(0, "I2A96", { fg = "#ab8e8a" })
vim.api.nvim_set_hl(0, "I2A97", { fg = "#ceb7b0" })
vim.api.nvim_set_hl(0, "I2A98", { fg = "#98918e" })
vim.api.nvim_set_hl(0, "I2A99", { fg = "#979695" })
vim.api.nvim_set_hl(0, "I2A100", { fg = "#574e4c" })
vim.api.nvim_set_hl(0, "I2A101", { fg = "#8f847f" })
vim.api.nvim_set_hl(0, "I2A102", { fg = "#97928f" })
vim.api.nvim_set_hl(0, "I2A103", { fg = "#a5a19b" })
vim.api.nvim_set_hl(0, "I2A104", { fg = "#403e40" })
vim.api.nvim_set_hl(0, "I2A105", { fg = "#979493" })
vim.api.nvim_set_hl(0, "I2A106", { fg = "#bdc1c0" })
vim.api.nvim_set_hl(0, "I2A107", { fg = "#61615f" })
vim.api.nvim_set_hl(0, "I2A108", { fg = "#8e8b87" })
vim.api.nvim_set_hl(0, "I2A109", { fg = "#737277" })
vim.api.nvim_set_hl(0, "I2A110", { fg = "#807676" })
vim.api.nvim_set_hl(0, "I2A111", { fg = "#927976" })
vim.api.nvim_set_hl(0, "I2A112", { fg = "#c4b6b0" })
vim.api.nvim_set_hl(0, "I2A113", { fg = "#cec6bf" })
vim.api.nvim_set_hl(0, "I2A114", { fg = "#a79f9d" })
vim.api.nvim_set_hl(0, "I2A115", { fg = "#b8b0af" })
vim.api.nvim_set_hl(0, "I2A116", { fg = "#8e9192" })
vim.api.nvim_set_hl(0, "I2A117", { fg = "#302e31" })
vim.api.nvim_set_hl(0, "I2A118", { fg = "#8d857e" })
vim.api.nvim_set_hl(0, "I2A119", { fg = "#bfb5a6" })
vim.api.nvim_set_hl(0, "I2A120", { fg = "#c3bead" })
vim.api.nvim_set_hl(0, "I2A121", { fg = "#535152" })
vim.api.nvim_set_hl(0, "I2A122", { fg = "#757070" })
vim.api.nvim_set_hl(0, "I2A123", { fg = "#7a7778" })
vim.api.nvim_set_hl(0, "I2A124", { fg = "#5d5c5e" })
vim.api.nvim_set_hl(0, "I2A125", { fg = "#946d6c" })
vim.api.nvim_set_hl(0, "I2A126", { fg = "#8a6665" })
vim.api.nvim_set_hl(0, "I2A127", { fg = "#d89c97" })
vim.api.nvim_set_hl(0, "I2A128", { fg = "#d0c0b9" })
vim.api.nvim_set_hl(0, "I2A129", { fg = "#a2918e" })
vim.api.nvim_set_hl(0, "I2A130", { fg = "#7b8388" })
vim.api.nvim_set_hl(0, "I2A131", { fg = "#848081" })
vim.api.nvim_set_hl(0, "I2A132", { fg = "#464549" })
vim.api.nvim_set_hl(0, "I2A133", { fg = "#7a787c" })
vim.api.nvim_set_hl(0, "I2A134", { fg = "#878485" })
vim.api.nvim_set_hl(0, "I2A135", { fg = "#5d5b60" })
vim.api.nvim_set_hl(0, "I2A136", { fg = "#bfb7aa" })
vim.api.nvim_set_hl(0, "I2A137", { fg = "#706c63" })
vim.api.nvim_set_hl(0, "I2A138", { fg = "#686263" })
vim.api.nvim_set_hl(0, "I2A139", { fg = "#949899" })
vim.api.nvim_set_hl(0, "I2A140", { fg = "#4b4143" })
vim.api.nvim_set_hl(0, "I2A141", { fg = "#98807f" })
vim.api.nvim_set_hl(0, "I2A142", { fg = "#8c7c7c" })
vim.api.nvim_set_hl(0, "I2A143", { fg = "#bcada3" })
vim.api.nvim_set_hl(0, "I2A144", { fg = "#867470" })
vim.api.nvim_set_hl(0, "I2A145", { fg = "#bcb8b4" })
vim.api.nvim_set_hl(0, "I2A146", { fg = "#b6b0ac" })
vim.api.nvim_set_hl(0, "I2A147", { fg = "#848285" })
vim.api.nvim_set_hl(0, "I2A148", { fg = "#4d4b4d" })
vim.api.nvim_set_hl(0, "I2A149", { fg = "#6d6c6e" })
vim.api.nvim_set_hl(0, "I2A150", { fg = "#5b5856" })
vim.api.nvim_set_hl(0, "I2A151", { fg = "#c8c7b8" })
vim.api.nvim_set_hl(0, "I2A152", { fg = "#55514e" })
vim.api.nvim_set_hl(0, "I2A153", { fg = "#747274" })
vim.api.nvim_set_hl(0, "I2A154", { fg = "#66615d" })
vim.api.nvim_set_hl(0, "I2A155", { fg = "#817d7c" })
vim.api.nvim_set_hl(0, "I2A156", { fg = "#5c585a" })
vim.api.nvim_set_hl(0, "I2A157", { fg = "#2c2b2f" })
vim.api.nvim_set_hl(0, "I2A158", { fg = "#7b6461" })
vim.api.nvim_set_hl(0, "I2A159", { fg = "#b9a6a0" })
vim.api.nvim_set_hl(0, "I2A160", { fg = "#3e373a" })
vim.api.nvim_set_hl(0, "I2A161", { fg = "#3e4144" })
vim.api.nvim_set_hl(0, "I2A162", { fg = "#565659" })
vim.api.nvim_set_hl(0, "I2A163", { fg = "#55534f" })
vim.api.nvim_set_hl(0, "I2A164", { fg = "#87837a" })
vim.api.nvim_set_hl(0, "I2A165", { fg = "#aca697" })
vim.api.nvim_set_hl(0, "I2A166", { fg = "#837d77" })
vim.api.nvim_set_hl(0, "I2A167", { fg = "#4b4647" })
vim.api.nvim_set_hl(0, "I2A168", { fg = "#2e2b2b" })
vim.api.nvim_set_hl(0, "I2A169", { fg = "#1d1d1e" })
vim.api.nvim_set_hl(0, "I2A170", { fg = "#5f5a53" })
vim.api.nvim_set_hl(0, "I2A171", { fg = "#403f40" })
vim.api.nvim_set_hl(0, "I2A172", { fg = "#888684" })
vim.api.nvim_set_hl(0, "I2A173", { fg = "#bbc0bb" })
vim.api.nvim_set_hl(0, "I2A174", { fg = "#cecbc6" })
vim.api.nvim_set_hl(0, "I2A175", { fg = "#a19c9b" })
vim.api.nvim_set_hl(0, "I2A176", { fg = "#858178" })
vim.api.nvim_set_hl(0, "I2A177", { fg = "#797670" })
vim.api.nvim_set_hl(0, "I2A178", { fg = "#747169" })
vim.api.nvim_set_hl(0, "I2A179", { fg = "#343230" })
vim.api.nvim_set_hl(0, "I2A180", { fg = "#111113" })
vim.api.nvim_set_hl(0, "I2A181", { fg = "#6d6b6b" })
vim.api.nvim_set_hl(0, "I2A182", { fg = "#979286" })
vim.api.nvim_set_hl(0, "I2A183", { fg = "#66625e" })
vim.api.nvim_set_hl(0, "I2A184", { fg = "#676360" })
vim.api.nvim_set_hl(0, "I2A185", { fg = "#575458" })
vim.api.nvim_set_hl(0, "I2A186", { fg = "#171516" })
vim.api.nvim_set_hl(0, "I2A187", { fg = "#312927" })
vim.api.nvim_set_hl(0, "I2A188", { fg = "#483e3c" })
vim.api.nvim_set_hl(0, "I2A189", { fg = "#959181" })
vim.api.nvim_set_hl(0, "I2A190", { fg = "#2e2a28" })
vim.api.nvim_set_hl(0, "I2A191", { fg = "#947a74" })
vim.api.nvim_set_hl(0, "I2A192", { fg = "#4f4d49" })
vim.api.nvim_set_hl(0, "I2A193", { fg = "#382f2d" })
vim.api.nvim_set_hl(0, "I2A194", { fg = "#292120" })
vim.api.nvim_set_hl(0, "I2A195", { fg = "#3c3434" })
vim.api.nvim_set_hl(0, "I2A196", { fg = "#63524e" })
vim.api.nvim_set_hl(0, "I2A197", { fg = "#695754" })
vim.api.nvim_set_hl(0, "I2A198", { fg = "#6f5d5b" })
vim.api.nvim_set_hl(0, "I2A199", { fg = "#3e3434" })
vim.api.nvim_set_hl(0, "I2A200", { fg = "#666d6e" })
vim.api.nvim_set_hl(0, "I2A201", { fg = "#73797b" })
vim.api.nvim_set_hl(0, "I2A202", { fg = "#746f6d" })
vim.api.nvim_set_hl(0, "I2A203", { fg = "#403f42" })
vim.api.nvim_set_hl(0, "I2A204", { fg = "#b9b3a3" })
vim.api.nvim_set_hl(0, "I2A205", { fg = "#060607" })
vim.api.nvim_set_hl(0, "I2A206", { fg = "#4d4c4b" })
vim.api.nvim_set_hl(0, "I2A207", { fg = "#675c55" })
vim.api.nvim_set_hl(0, "I2A208", { fg = "#5a4a47" })
vim.api.nvim_set_hl(0, "I2A209", { fg = "#4d4447" })
vim.api.nvim_set_hl(0, "I2A210", { fg = "#514e51" })
vim.api.nvim_set_hl(0, "I2A211", { fg = "#b7b1ad" })
vim.api.nvim_set_hl(0, "I2A212", { fg = "#32302b" })
vim.api.nvim_set_hl(0, "I2A213", { fg = "#1d1c20" })
vim.api.nvim_set_hl(0, "I2A214", { fg = "#222127" })
vim.api.nvim_set_hl(0, "I2A215", { fg = "#343233" })
vim.api.nvim_set_hl(0, "I2A216", { fg = "#17161a" })
vim.api.nvim_set_hl(0, "I2A217", { fg = "#55534d" })
vim.api.nvim_set_hl(0, "I2A218", { fg = "#c9c2b1" })
vim.api.nvim_set_hl(0, "I2A219", { fg = "#19171a" })
vim.api.nvim_set_hl(0, "I2A220", { fg = "#131114" })
vim.api.nvim_set_hl(0, "I2A221", { fg = "#494641" })
vim.api.nvim_set_hl(0, "I2A222", { fg = "#0d0c0d" })
dashboard.section.header.opts.hl = {
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A2", 45, 48 },   { "I2A2", 48, 51 },   { "I2A2", 51, 54 },   { "I2A2", 54, 57 },   { "I2A2", 57, 60 },   { "I2A2", 60, 63 },   { "I2A3", 63, 66 },   { "I2A4", 66, 69 },   { "I2A5", 69, 72 },   { "I2A6", 72, 75 },   { "I2A7", 75, 78 },   { "I2A7", 78, 81 },   { "I2A7", 81, 84 },   { "I2A8", 84, 87 },   { "I2A5", 87, 90 },   { "I2A5", 90, 93 },   { "I2A9", 93, 96 },   { "I2A10", 96, 99 },  { "I2A9", 99, 102 },   { "I2A11", 102, 105 },  { "I2A12", 105, 108 },  { "I2A2", 108, 111 },   { "I2A2", 111, 114 },   { "I2A2", 114, 117 },   { "I2A2", 117, 120 },   { "I2A2", 120, 123 },   { "I2A2", 123, 126 },   { "I2A2", 126, 129 },   { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A2", 45, 48 },   { "I2A2", 48, 51 },   { "I2A2", 51, 54 },   { "I2A2", 54, 57 },   { "I2A13", 57, 60 },  { "I2A14", 60, 63 },  { "I2A15", 63, 66 },  { "I2A16", 66, 69 },  { "I2A17", 69, 72 },  { "I2A16", 72, 75 },  { "I2A18", 75, 78 },  { "I2A19", 78, 81 },  { "I2A20", 81, 84 },  { "I2A17", 84, 87 },  { "I2A21", 87, 90 },  { "I2A22", 90, 93 },  { "I2A23", 93, 96 },  { "I2A24", 96, 99 },  { "I2A25", 99, 102 },  { "I2A26", 102, 105 },  { "I2A27", 105, 108 },  { "I2A28", 108, 111 },  { "I2A29", 111, 114 },  { "I2A2", 114, 117 },   { "I2A2", 117, 120 },   { "I2A2", 120, 123 },   { "I2A2", 123, 126 },   { "I2A2", 126, 129 },   { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A2", 45, 48 },   { "I2A2", 48, 51 },   { "I2A30", 51, 54 },  { "I2A28", 54, 57 },  { "I2A0", 57, 60 },   { "I2A31", 60, 63 },  { "I2A32", 63, 66 },  { "I2A33", 66, 69 },  { "I2A34", 69, 72 },  { "I2A35", 72, 75 },  { "I2A36", 75, 78 },  { "I2A37", 78, 81 },  { "I2A37", 81, 84 },  { "I2A34", 84, 87 },  { "I2A34", 87, 90 },  { "I2A38", 90, 93 },  { "I2A22", 93, 96 },  { "I2A21", 96, 99 },  { "I2A21", 99, 102 },  { "I2A39", 102, 105 },  { "I2A36", 105, 108 },  { "I2A35", 108, 111 },  { "I2A40", 111, 114 },  { "I2A28", 114, 117 },  { "I2A41", 117, 120 },  { "I2A2", 120, 123 },   { "I2A2", 123, 126 },   { "I2A2", 126, 129 },   { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A2", 45, 48 },   { "I2A42", 48, 51 },  { "I2A43", 51, 54 },  { "I2A44", 54, 57 },  { "I2A45", 57, 60 },  { "I2A33", 60, 63 },  { "I2A35", 63, 66 },  { "I2A36", 66, 69 },  { "I2A46", 69, 72 },  { "I2A47", 72, 75 },  { "I2A35", 75, 78 },  { "I2A36", 78, 81 },  { "I2A48", 81, 84 },  { "I2A36", 84, 87 },  { "I2A36", 87, 90 },  { "I2A49", 90, 93 },  { "I2A34", 93, 96 },  { "I2A50", 96, 99 },  { "I2A16", 99, 102 },  { "I2A0", 102, 105 },   { "I2A46", 105, 108 },  { "I2A36", 108, 111 },  { "I2A36", 111, 114 },  { "I2A51", 114, 117 },  { "I2A28", 117, 120 },  { "I2A52", 120, 123 },  { "I2A2", 123, 126 },   { "I2A2", 126, 129 },   { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A12", 45, 48 },  { "I2A53", 48, 51 },  { "I2A10", 51, 54 },  { "I2A45", 54, 57 },  { "I2A9", 57, 60 },   { "I2A36", 60, 63 },  { "I2A26", 63, 66 },  { "I2A36", 66, 69 },  { "I2A36", 69, 72 },  { "I2A36", 72, 75 },  { "I2A48", 75, 78 },  { "I2A36", 78, 81 },  { "I2A36", 81, 84 },  { "I2A35", 84, 87 },  { "I2A33", 87, 90 },  { "I2A36", 90, 93 },  { "I2A46", 93, 96 },  { "I2A9", 96, 99 },   { "I2A34", 99, 102 },  { "I2A54", 102, 105 },  { "I2A55", 105, 108 },  { "I2A36", 108, 111 },  { "I2A36", 111, 114 },  { "I2A37", 114, 117 },  { "I2A56", 117, 120 },  { "I2A28", 120, 123 },  { "I2A57", 123, 126 },  { "I2A58", 126, 129 },  { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A59", 45, 48 },  { "I2A45", 48, 51 },  { "I2A45", 51, 54 },  { "I2A45", 54, 57 },  { "I2A60", 57, 60 },  { "I2A35", 60, 63 },  { "I2A47", 63, 66 },  { "I2A49", 66, 69 },  { "I2A36", 69, 72 },  { "I2A36", 72, 75 },  { "I2A36", 75, 78 },  { "I2A61", 78, 81 },  { "I2A33", 81, 84 },  { "I2A36", 84, 87 },  { "I2A36", 87, 90 },  { "I2A35", 90, 93 },  { "I2A36", 93, 96 },  { "I2A35", 96, 99 },  { "I2A9", 99, 102 },   { "I2A8", 102, 105 },   { "I2A62", 105, 108 },  { "I2A36", 108, 111 },  { "I2A36", 111, 114 },  { "I2A46", 114, 117 },  { "I2A63", 117, 120 },  { "I2A53", 120, 123 },  { "I2A28", 123, 126 },  { "I2A64", 126, 129 },  { "I2A65", 129, 132 },  { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A13", 42, 45 },  { "I2A66", 45, 48 },  { "I2A67", 48, 51 },  { "I2A45", 51, 54 },  { "I2A68", 54, 57 },  { "I2A0", 57, 60 },   { "I2A69", 60, 63 },  { "I2A26", 63, 66 },  { "I2A70", 66, 69 },  { "I2A36", 69, 72 },  { "I2A36", 72, 75 },  { "I2A36", 75, 78 },  { "I2A36", 78, 81 },  { "I2A5", 81, 84 },   { "I2A35", 84, 87 },  { "I2A36", 87, 90 },  { "I2A36", 90, 93 },  { "I2A35", 93, 96 },  { "I2A35", 96, 99 },  { "I2A71", 99, 102 },  { "I2A9", 102, 105 },   { "I2A8", 105, 108 },   { "I2A33", 108, 111 },  { "I2A26", 111, 114 },  { "I2A34", 114, 117 },  { "I2A72", 117, 120 },  { "I2A73", 120, 123 },  { "I2A28", 123, 126 },  { "I2A74", 126, 129 },  { "I2A75", 129, 132 },  { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A12", 39, 42 },  { "I2A76", 42, 45 },  { "I2A45", 45, 48 },  { "I2A71", 48, 51 },  { "I2A10", 51, 54 },  { "I2A77", 54, 57 },  { "I2A22", 57, 60 },  { "I2A16", 60, 63 },  { "I2A39", 63, 66 },  { "I2A9", 66, 69 },   { "I2A5", 69, 72 },   { "I2A48", 72, 75 },  { "I2A26", 75, 78 },  { "I2A33", 78, 81 },  { "I2A36", 81, 84 },  { "I2A33", 84, 87 },  { "I2A35", 87, 90 },  { "I2A9", 90, 93 },   { "I2A33", 93, 96 },  { "I2A35", 96, 99 },  { "I2A67", 99, 102 },  { "I2A9", 102, 105 },   { "I2A71", 105, 108 },  { "I2A9", 108, 111 },   { "I2A9", 111, 114 },   { "I2A5", 114, 117 },   { "I2A28", 117, 120 },  { "I2A56", 120, 123 },  { "I2A28", 123, 126 },  { "I2A74", 126, 129 },  { "I2A78", 129, 132 },  { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A79", 39, 42 },  { "I2A80", 42, 45 },  { "I2A74", 45, 48 },  { "I2A81", 48, 51 },  { "I2A9", 51, 54 },   { "I2A77", 54, 57 },  { "I2A82", 57, 60 },  { "I2A22", 60, 63 },  { "I2A22", 63, 66 },  { "I2A82", 66, 69 },  { "I2A83", 69, 72 },  { "I2A84", 72, 75 },  { "I2A67", 75, 78 },  { "I2A8", 78, 81 },   { "I2A26", 81, 84 },  { "I2A36", 84, 87 },  { "I2A85", 87, 90 },  { "I2A26", 90, 93 },  { "I2A9", 93, 96 },   { "I2A35", 96, 99 },  { "I2A9", 99, 102 },   { "I2A5", 102, 105 },   { "I2A86", 105, 108 },  { "I2A9", 108, 111 },   { "I2A27", 111, 114 },  { "I2A45", 114, 117 },  { "I2A28", 117, 120 },  { "I2A28", 120, 123 },  { "I2A63", 123, 126 },  { "I2A28", 126, 129 },  { "I2A87", 129, 132 },  { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A88", 9, 12 }, { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A89", 39, 42 },  { "I2A80", 42, 45 },  { "I2A90", 45, 48 },  { "I2A91", 48, 51 },  { "I2A92", 51, 54 },  { "I2A91", 54, 57 },  { "I2A0", 57, 60 },   { "I2A93", 60, 63 },  { "I2A94", 63, 66 },  { "I2A95", 66, 69 },  { "I2A96", 69, 72 },  { "I2A97", 72, 75 },  { "I2A98", 75, 78 },  { "I2A99", 78, 81 },  { "I2A100", 81, 84 }, { "I2A48", 84, 87 },  { "I2A26", 87, 90 },  { "I2A71", 90, 93 },  { "I2A71", 93, 96 },  { "I2A71", 96, 99 },  { "I2A9", 99, 102 },   { "I2A9", 102, 105 },   { "I2A9", 105, 108 },   { "I2A71", 108, 111 },  { "I2A71", 111, 114 },  { "I2A101", 114, 117 }, { "I2A63", 117, 120 },  { "I2A28", 120, 123 },  { "I2A102", 123, 126 }, { "I2A63", 126, 129 },  { "I2A103", 129, 132 }, { "I2A88", 132, 135 },  { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A88", 12, 15 }, { "I2A88", 15, 18 },  { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A104", 39, 42 }, { "I2A75", 42, 45 },  { "I2A105", 45, 48 }, { "I2A74", 48, 51 },  { "I2A106", 51, 54 }, { "I2A107", 54, 57 }, { "I2A108", 57, 60 }, { "I2A109", 60, 63 }, { "I2A95", 63, 66 },  { "I2A95", 66, 69 },  { "I2A110", 69, 72 }, { "I2A111", 72, 75 }, { "I2A112", 75, 78 }, { "I2A113", 78, 81 }, { "I2A113", 81, 84 }, { "I2A113", 84, 87 }, { "I2A114", 87, 90 }, { "I2A115", 90, 93 }, { "I2A116", 93, 96 }, { "I2A9", 96, 99 },   { "I2A9", 99, 102 },   { "I2A8", 102, 105 },   { "I2A5", 105, 108 },   { "I2A9", 108, 111 },   { "I2A45", 111, 114 },  { "I2A117", 114, 117 }, { "I2A74", 117, 120 },  { "I2A64", 120, 123 },  { "I2A90", 123, 126 },  { "I2A63", 126, 129 },  { "I2A118", 129, 132 }, { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A119", 138, 141 }, { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A88", 9, 12 }, { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A120", 18, 21 }, { "I2A88", 21, 24 },  { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A12", 39, 42 },  { "I2A121", 42, 45 }, { "I2A122", 45, 48 }, { "I2A123", 48, 51 }, { "I2A74", 51, 54 },  { "I2A83", 54, 57 },  { "I2A22", 57, 60 },  { "I2A124", 60, 63 }, { "I2A95", 63, 66 },  { "I2A95", 66, 69 },  { "I2A125", 69, 72 }, { "I2A126", 72, 75 }, { "I2A127", 75, 78 }, { "I2A128", 78, 81 }, { "I2A113", 81, 84 }, { "I2A113", 84, 87 }, { "I2A113", 87, 90 }, { "I2A129", 90, 93 }, { "I2A130", 93, 96 }, { "I2A9", 96, 99 },   { "I2A5", 99, 102 },   { "I2A8", 102, 105 },   { "I2A9", 105, 108 },   { "I2A43", 108, 111 },  { "I2A131", 111, 114 }, { "I2A132", 114, 117 }, { "I2A133", 117, 120 }, { "I2A134", 120, 123 }, { "I2A64", 123, 126 },  { "I2A135", 126, 129 }, { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A88", 135, 138 },  { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A136", 144, 147 }, { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A88", 15, 18 },  { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A88", 24, 27 },  { "I2A88", 27, 30 },  { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A137", 42, 45 }, { "I2A90", 45, 48 },  { "I2A138", 48, 51 }, { "I2A59", 51, 54 },  { "I2A74", 54, 57 },  { "I2A139", 57, 60 }, { "I2A76", 60, 63 },  { "I2A140", 63, 66 }, { "I2A95", 66, 69 },  { "I2A141", 69, 72 }, { "I2A142", 72, 75 }, { "I2A143", 75, 78 }, { "I2A113", 78, 81 }, { "I2A113", 81, 84 }, { "I2A113", 84, 87 }, { "I2A113", 87, 90 }, { "I2A144", 90, 93 }, { "I2A9", 93, 96 },   { "I2A83", 96, 99 },  { "I2A145", 99, 102 }, { "I2A43", 102, 105 },  { "I2A146", 105, 108 }, { "I2A147", 108, 111 }, { "I2A109", 111, 114 }, { "I2A148", 114, 117 }, { "I2A109", 117, 120 }, { "I2A149", 120, 123 }, { "I2A150", 123, 126 }, { "I2A151", 126, 129 }, { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A88", 141, 144 },  { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A119", 150, 153 }, { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A88", 21, 24 },  { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A120", 30, 33 }, { "I2A88", 33, 36 },  { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A120", 42, 45 }, { "I2A152", 45, 48 }, { "I2A153", 48, 51 }, { "I2A154", 51, 54 }, { "I2A155", 54, 57 }, { "I2A122", 57, 60 }, { "I2A156", 60, 63 }, { "I2A138", 63, 66 }, { "I2A157", 66, 69 }, { "I2A158", 69, 72 }, { "I2A159", 72, 75 }, { "I2A159", 75, 78 }, { "I2A159", 78, 81 }, { "I2A144", 81, 84 }, { "I2A160", 84, 87 }, { "I2A23", 87, 90 },  { "I2A16", 90, 93 },  { "I2A161", 93, 96 }, { "I2A7", 96, 99 },   { "I2A54", 99, 102 },  { "I2A162", 102, 105 }, { "I2A109", 105, 108 }, { "I2A163", 108, 111 }, { "I2A164", 111, 114 }, { "I2A135", 114, 117 }, { "I2A165", 117, 120 }, { "I2A2", 120, 123 },   { "I2A2", 123, 126 },   { "I2A2", 126, 129 },   { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A120", 147, 150 }, { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A88", 27, 30 },  { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A88", 36, 39 },  { "I2A88", 39, 42 },  { "I2A2", 42, 45 },   { "I2A1", 45, 48 },   { "I2A2", 48, 51 },   { "I2A3", 51, 54 },   { "I2A2", 54, 57 },   { "I2A58", 57, 60 },  { "I2A166", 60, 63 }, { "I2A12", 63, 66 },  { "I2A167", 66, 69 }, { "I2A166", 69, 72 }, { "I2A168", 72, 75 }, { "I2A0", 75, 78 },   { "I2A0", 78, 81 },   { "I2A0", 81, 84 },   { "I2A0", 84, 87 },   { "I2A16", 87, 90 },  { "I2A22", 90, 93 },  { "I2A21", 93, 96 },  { "I2A82", 96, 99 },  { "I2A169", 99, 102 }, { "I2A1", 102, 105 },   { "I2A137", 105, 108 }, { "I2A2", 108, 111 },   { "I2A2", 111, 114 },   { "I2A2", 114, 117 },   { "I2A2", 117, 120 },   { "I2A2", 120, 123 },   { "I2A2", 123, 126 },   { "I2A2", 126, 129 },   { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A88", 153, 156 }, { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A88", 33, 36 },  { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A88", 42, 45 },  { "I2A88", 45, 48 },  { "I2A2", 48, 51 },   { "I2A2", 51, 54 },   { "I2A2", 54, 57 },   { "I2A2", 57, 60 },   { "I2A2", 60, 63 },   { "I2A2", 63, 66 },   { "I2A2", 66, 69 },   { "I2A2", 69, 72 },   { "I2A1", 72, 75 },   { "I2A0", 75, 78 },   { "I2A0", 78, 81 },   { "I2A0", 81, 84 },   { "I2A21", 84, 87 },  { "I2A22", 87, 90 },  { "I2A22", 90, 93 },  { "I2A17", 93, 96 },  { "I2A22", 96, 99 },  { "I2A82", 99, 102 },  { "I2A21", 102, 105 },  { "I2A2", 105, 108 },   { "I2A2", 108, 111 },   { "I2A2", 111, 114 },   { "I2A2", 114, 117 },   { "I2A2", 117, 120 },   { "I2A2", 120, 123 },   { "I2A2", 123, 126 },   { "I2A2", 126, 129 },   { "I2A2", 129, 132 },   { "I2A2", 132, 135 },   { "I2A2", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A2", 45, 48 },   { "I2A120", 48, 51 }, { "I2A88", 51, 54 },  { "I2A2", 54, 57 },   { "I2A2", 57, 60 },   { "I2A2", 60, 63 },   { "I2A2", 63, 66 },   { "I2A2", 66, 69 },   { "I2A2", 69, 72 },   { "I2A170", 72, 75 }, { "I2A0", 75, 78 },   { "I2A0", 78, 81 },   { "I2A82", 81, 84 },  { "I2A17", 84, 87 },  { "I2A22", 87, 90 },  { "I2A16", 90, 93 },  { "I2A21", 93, 96 },  { "I2A22", 96, 99 },  { "I2A16", 99, 102 },  { "I2A82", 102, 105 },  { "I2A0", 105, 108 },   { "I2A169", 108, 111 }, { "I2A171", 111, 114 }, { "I2A172", 114, 117 }, { "I2A173", 117, 120 }, { "I2A9", 120, 123 },   { "I2A9", 123, 126 },   { "I2A9", 126, 129 },   { "I2A174", 129, 132 }, { "I2A175", 132, 135 }, { "I2A1", 135, 138 },   { "I2A2", 138, 141 },   { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A2", 39, 42 },   { "I2A2", 42, 45 },   { "I2A176", 45, 48 }, { "I2A75", 48, 51 },  { "I2A75", 51, 54 },  { "I2A118", 54, 57 }, { "I2A176", 57, 60 }, { "I2A177", 60, 63 }, { "I2A178", 63, 66 }, { "I2A179", 66, 69 }, { "I2A0", 69, 72 },   { "I2A0", 72, 75 },   { "I2A0", 75, 78 },   { "I2A0", 78, 81 },   { "I2A180", 81, 84 }, { "I2A20", 84, 87 },  { "I2A21", 87, 90 },  { "I2A17", 90, 93 },  { "I2A82", 93, 96 },  { "I2A16", 96, 99 },  { "I2A82", 99, 102 },  { "I2A181", 102, 105 }, { "I2A67", 105, 108 },  { "I2A86", 108, 111 },  { "I2A9", 111, 114 },   { "I2A9", 114, 117 },   { "I2A9", 117, 120 },   { "I2A9", 120, 123 },   { "I2A9", 123, 126 },   { "I2A9", 126, 129 },   { "I2A9", 129, 132 },   { "I2A67", 132, 135 },  { "I2A113", 135, 138 }, { "I2A182", 138, 141 }, { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A2", 36, 39 },   { "I2A183", 39, 42 }, { "I2A109", 42, 45 }, { "I2A109", 45, 48 }, { "I2A109", 48, 51 }, { "I2A109", 51, 54 }, { "I2A109", 54, 57 }, { "I2A162", 57, 60 }, { "I2A0", 60, 63 },   { "I2A0", 63, 66 },   { "I2A0", 66, 69 },   { "I2A0", 69, 72 },   { "I2A0", 72, 75 },   { "I2A0", 75, 78 },   { "I2A0", 78, 81 },   { "I2A0", 81, 84 },   { "I2A0", 84, 87 },   { "I2A0", 87, 90 },   { "I2A82", 90, 93 },  { "I2A22", 93, 96 },  { "I2A82", 96, 99 },  { "I2A184", 99, 102 }, { "I2A9", 102, 105 },   { "I2A9", 105, 108 },   { "I2A9", 108, 111 },   { "I2A9", 111, 114 },   { "I2A9", 114, 117 },   { "I2A9", 117, 120 },   { "I2A9", 120, 123 },   { "I2A9", 123, 126 },   { "I2A9", 126, 129 },   { "I2A9", 129, 132 },   { "I2A9", 132, 135 },   { "I2A174", 135, 138 }, { "I2A183", 138, 141 }, { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A2", 33, 36 },   { "I2A185", 36, 39 }, { "I2A109", 39, 42 }, { "I2A109", 42, 45 }, { "I2A109", 45, 48 }, { "I2A109", 48, 51 }, { "I2A162", 51, 54 }, { "I2A0", 54, 57 },   { "I2A0", 57, 60 },   { "I2A0", 60, 63 },   { "I2A0", 63, 66 },   { "I2A186", 66, 69 }, { "I2A187", 69, 72 }, { "I2A188", 72, 75 }, { "I2A0", 75, 78 },   { "I2A82", 78, 81 },  { "I2A16", 81, 84 },  { "I2A180", 84, 87 }, { "I2A21", 87, 90 },  { "I2A22", 90, 93 },  { "I2A22", 93, 96 },  { "I2A180", 96, 99 }, { "I2A184", 99, 102 }, { "I2A9", 102, 105 },   { "I2A9", 105, 108 },   { "I2A9", 108, 111 },   { "I2A9", 111, 114 },   { "I2A9", 114, 117 },   { "I2A9", 117, 120 },   { "I2A9", 120, 123 },   { "I2A9", 123, 126 },   { "I2A9", 126, 129 },   { "I2A9", 129, 132 },   { "I2A9", 132, 135 },   { "I2A67", 135, 138 },  { "I2A184", 138, 141 }, { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A2", 30, 33 },   { "I2A189", 33, 36 }, { "I2A109", 36, 39 }, { "I2A109", 39, 42 }, { "I2A109", 42, 45 }, { "I2A162", 45, 48 }, { "I2A0", 48, 51 },   { "I2A0", 51, 54 },   { "I2A187", 54, 57 }, { "I2A190", 57, 60 }, { "I2A191", 60, 63 }, { "I2A82", 63, 66 },  { "I2A187", 66, 69 }, { "I2A0", 69, 72 },   { "I2A191", 72, 75 }, { "I2A0", 75, 78 },   { "I2A0", 78, 81 },   { "I2A0", 81, 84 },   { "I2A82", 84, 87 },  { "I2A21", 87, 90 },  { "I2A22", 90, 93 },  { "I2A82", 93, 96 },  { "I2A0", 96, 99 },   { "I2A0", 99, 102 },   { "I2A9", 102, 105 },   { "I2A9", 105, 108 },   { "I2A9", 108, 111 },   { "I2A86", 111, 114 },  { "I2A9", 114, 117 },   { "I2A9", 117, 120 },   { "I2A9", 120, 123 },   { "I2A9", 123, 126 },   { "I2A9", 126, 129 },   { "I2A9", 129, 132 },   { "I2A9", 132, 135 },   { "I2A67", 135, 138 },  { "I2A184", 138, 141 }, { "I2A2", 141, 144 },   { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A2", 27, 30 },   { "I2A192", 30, 33 }, { "I2A0", 33, 36 },   { "I2A0", 36, 39 },   { "I2A169", 39, 42 }, { "I2A169", 42, 45 }, { "I2A187", 45, 48 }, { "I2A193", 48, 51 }, { "I2A194", 51, 54 }, { "I2A187", 54, 57 }, { "I2A0", 57, 60 },   { "I2A195", 60, 63 }, { "I2A196", 63, 66 }, { "I2A187", 66, 69 }, { "I2A0", 69, 72 },   { "I2A0", 72, 75 },   { "I2A186", 75, 78 }, { "I2A0", 78, 81 },   { "I2A197", 81, 84 }, { "I2A198", 84, 87 }, { "I2A199", 87, 90 }, { "I2A22", 90, 93 },  { "I2A180", 93, 96 }, { "I2A0", 96, 99 },   { "I2A0", 99, 102 },   { "I2A39", 102, 105 },  { "I2A9", 105, 108 },   { "I2A67", 108, 111 },  { "I2A113", 111, 114 }, { "I2A113", 114, 117 }, { "I2A174", 117, 120 }, { "I2A9", 120, 123 },   { "I2A81", 123, 126 },  { "I2A200", 126, 129 }, { "I2A200", 129, 132 }, { "I2A201", 132, 135 }, { "I2A202", 135, 138 }, { "I2A203", 138, 141 }, { "I2A204", 141, 144 }, { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A204", 18, 21 }, { "I2A205", 21, 24 }, { "I2A0", 24, 27 },   { "I2A0", 27, 30 },   { "I2A0", 30, 33 },   { "I2A0", 33, 36 },   { "I2A82", 36, 39 },  { "I2A22", 39, 42 },  { "I2A17", 42, 45 },  { "I2A22", 45, 48 },  { "I2A22", 48, 51 },  { "I2A22", 51, 54 },  { "I2A22", 54, 57 },  { "I2A206", 57, 60 }, { "I2A207", 60, 63 }, { "I2A208", 63, 66 }, { "I2A209", 66, 69 }, { "I2A22", 69, 72 },  { "I2A22", 72, 75 },  { "I2A22", 75, 78 },  { "I2A22", 78, 81 },  { "I2A22", 81, 84 },  { "I2A22", 84, 87 },  { "I2A22", 87, 90 },  { "I2A22", 90, 93 },  { "I2A22", 93, 96 },  { "I2A16", 96, 99 },  { "I2A0", 99, 102 },   { "I2A0", 102, 105 },   { "I2A210", 105, 108 }, { "I2A211", 108, 111 }, { "I2A109", 111, 114 }, { "I2A205", 114, 117 }, { "I2A82", 117, 120 },  { "I2A17", 120, 123 },  { "I2A22", 123, 126 },  { "I2A82", 126, 129 },  { "I2A0", 129, 132 },   { "I2A21", 132, 135 },  { "I2A22", 135, 138 },  { "I2A22", 138, 141 },  { "I2A205", 141, 144 }, { "I2A2", 144, 147 },   { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A212", 21, 24 }, { "I2A0", 24, 27 },   { "I2A0", 27, 30 },   { "I2A0", 30, 33 },   { "I2A213", 33, 36 }, { "I2A22", 36, 39 },  { "I2A22", 39, 42 },  { "I2A22", 42, 45 },  { "I2A22", 45, 48 },  { "I2A22", 48, 51 },  { "I2A22", 51, 54 },  { "I2A22", 54, 57 },  { "I2A22", 57, 60 },  { "I2A17", 60, 63 },  { "I2A21", 63, 66 },  { "I2A21", 66, 69 },  { "I2A22", 69, 72 },  { "I2A22", 72, 75 },  { "I2A22", 75, 78 },  { "I2A22", 78, 81 },  { "I2A22", 81, 84 },  { "I2A22", 84, 87 },  { "I2A22", 87, 90 },  { "I2A22", 90, 93 },  { "I2A214", 93, 96 }, { "I2A205", 96, 99 }, { "I2A0", 99, 102 },   { "I2A0", 102, 105 },   { "I2A0", 105, 108 },   { "I2A215", 108, 111 }, { "I2A215", 111, 114 }, { "I2A205", 114, 117 }, { "I2A216", 117, 120 }, { "I2A17", 120, 123 },  { "I2A22", 123, 126 },  { "I2A22", 126, 129 },  { "I2A22", 129, 132 },  { "I2A22", 132, 135 },  { "I2A22", 135, 138 },  { "I2A22", 138, 141 },  { "I2A22", 141, 144 },  { "I2A205", 144, 147 }, { "I2A217", 147, 150 }, { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A218", 21, 24 }, { "I2A0", 24, 27 },   { "I2A0", 27, 30 },   { "I2A0", 30, 33 },   { "I2A213", 33, 36 }, { "I2A214", 36, 39 }, { "I2A22", 39, 42 },  { "I2A22", 42, 45 },  { "I2A22", 45, 48 },  { "I2A22", 48, 51 },  { "I2A17", 51, 54 },  { "I2A213", 54, 57 }, { "I2A219", 57, 60 }, { "I2A213", 60, 63 }, { "I2A22", 63, 66 },  { "I2A17", 66, 69 },  { "I2A22", 69, 72 },  { "I2A22", 72, 75 },  { "I2A22", 75, 78 },  { "I2A22", 78, 81 },  { "I2A22", 81, 84 },  { "I2A22", 84, 87 },  { "I2A213", 87, 90 }, { "I2A220", 90, 93 }, { "I2A0", 93, 96 },   { "I2A0", 96, 99 },   { "I2A0", 99, 102 },   { "I2A0", 102, 105 },   { "I2A0", 105, 108 },   { "I2A82", 108, 111 },  { "I2A17", 111, 114 },  { "I2A16", 114, 117 },  { "I2A17", 117, 120 },  { "I2A22", 120, 123 },  { "I2A22", 123, 126 },  { "I2A22", 126, 129 },  { "I2A21", 129, 132 },  { "I2A20", 132, 135 },  { "I2A22", 135, 138 },  { "I2A22", 138, 141 },  { "I2A22", 141, 144 },  { "I2A82", 144, 147 },  { "I2A0", 147, 150 },   { "I2A0", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A221", 6, 9 }, { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A165", 15, 18 }, { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A189", 24, 27 }, { "I2A0", 27, 30 },   { "I2A0", 30, 33 },   { "I2A0", 33, 36 },   { "I2A0", 36, 39 },   { "I2A222", 39, 42 }, { "I2A219", 42, 45 }, { "I2A216", 45, 48 }, { "I2A222", 48, 51 }, { "I2A0", 51, 54 },   { "I2A222", 54, 57 }, { "I2A222", 57, 60 }, { "I2A222", 60, 63 }, { "I2A222", 63, 66 }, { "I2A222", 66, 69 }, { "I2A219", 69, 72 }, { "I2A219", 72, 75 }, { "I2A219", 75, 78 }, { "I2A219", 78, 81 }, { "I2A219", 81, 84 }, { "I2A205", 84, 87 }, { "I2A0", 87, 90 },   { "I2A0", 90, 93 },   { "I2A0", 93, 96 },   { "I2A0", 96, 99 },   { "I2A0", 99, 102 },   { "I2A0", 102, 105 },   { "I2A222", 105, 108 }, { "I2A214", 108, 111 }, { "I2A22", 111, 114 },  { "I2A180", 114, 117 }, { "I2A0", 117, 120 },   { "I2A21", 120, 123 },  { "I2A16", 123, 126 },  { "I2A16", 126, 129 },  { "I2A21", 129, 132 },  { "I2A21", 132, 135 },  { "I2A0", 135, 138 },   { "I2A0", 138, 141 },   { "I2A180", 141, 144 }, { "I2A0", 144, 147 },   { "I2A0", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
	{ { "I2A0", 0, 3 }, { "I2A0", 3, 6 }, { "I2A1", 6, 9 },   { "I2A2", 9, 12 },  { "I2A2", 12, 15 },  { "I2A2", 15, 18 },   { "I2A2", 18, 21 },   { "I2A2", 21, 24 },   { "I2A2", 24, 27 },   { "I2A212", 27, 30 }, { "I2A0", 30, 33 },   { "I2A0", 33, 36 },   { "I2A0", 36, 39 },   { "I2A0", 39, 42 },   { "I2A0", 42, 45 },   { "I2A0", 45, 48 },   { "I2A0", 48, 51 },   { "I2A0", 51, 54 },   { "I2A0", 54, 57 },   { "I2A0", 57, 60 },   { "I2A0", 60, 63 },   { "I2A0", 63, 66 },   { "I2A0", 66, 69 },   { "I2A0", 69, 72 },   { "I2A0", 72, 75 },   { "I2A0", 75, 78 },   { "I2A0", 78, 81 },   { "I2A0", 81, 84 },   { "I2A0", 84, 87 },   { "I2A0", 87, 90 },   { "I2A0", 90, 93 },   { "I2A0", 93, 96 },   { "I2A0", 96, 99 },   { "I2A0", 99, 102 },   { "I2A0", 102, 105 },   { "I2A0", 105, 108 },   { "I2A222", 108, 111 }, { "I2A205", 111, 114 }, { "I2A0", 114, 117 },   { "I2A0", 117, 120 },   { "I2A0", 120, 123 },   { "I2A0", 123, 126 },   { "I2A0", 126, 129 },   { "I2A0", 129, 132 },   { "I2A0", 132, 135 },   { "I2A0", 135, 138 },   { "I2A0", 138, 141 },   { "I2A179", 141, 144 }, { "I2A189", 144, 147 }, { "I2A2", 147, 150 },   { "I2A2", 150, 153 },   { "I2A2", 153, 156 },  { "I2A0", 156, 159 }, { "I2A0", 159, 162 }, },
}


local section_projects = {
	type = "group",
	val = {
		{
			type = "text",
			val = "Projects",
			opts = {
				hl = "Keyword",
				shrink_margin = false,
				position = "center",
			},
		},
		{ type = "padding", val = 1 },
		{
			type = "group",
			val = create_projects,
		},
	},
}

local section_sessions = {
	type = "group",
	val = {
		{
			type = "text",
			val = "Sessions",
			opts = {
				hl = "Keyword",
				shrink_margin = false,
				position = "center",
			},
		},
		{ type = "padding", val = 1 },
		{
			type = "group",
			val = create_sessions,
		},
	},
}

-- Set menu
local section_shotcuts = {
	type = "group",
	val = {
		{ type = "text",    val = "Menu", opts = { hl = "Keyword", position = "center" } },
		{ type = "padding", val = 1 },
		{
			type = "group",
			val = {
				create_shortcut('', "e", "  New file", "<cmd>ene<CR>"),
				create_shortcut('', "f", "  Find file", "<cmd>Telescope find_files<CR>"),
				create_shortcut('', "r", "  Recently", "<cmd>Telescope oldfiles<CR>"),
				-- create_shortcut('', "p", "  Projects", "<cmd>Telescope projects<CR>"),
				create_shortcut('', "s", "  Sessions", "<cmd>SessionManager load_session<CR>"),
			}
		}
		-- dashboard.button("c", "  Configuration", "<cmd>e ~/AppData/Local/nvim/init.lua <CR>"),
		-- dashboard.button("u", "  Update plugins", "<cmd>PackerSync<CR>"),
		-- dashboard.button("q", "  Quit", "<cmd>qa<CR>"),
	},
	position = "center",
}

local function get_info()
	-- local total_plugins = #vim.tbl_keys(_G.packer_plugins)
	local weeks = { "太阳星", "荧惑星", "辰星", "岁星", "太白星", "镇星", "太阴星" }
	-- local datetime = os.date(" %Y-%m-%d   %A")
	local datetime = os.date(" %Y-%m-%d")
	local wday = os.date("*t").wday
	local version = vim.version()
	local nvim_version_info = "   v" .. version.major .. "." .. version.minor .. "." .. version.patch
	return icons.ui.calendar ..
		datetime ..
		"  " .. icons.ui.calendar_minus_o .. " " .. weeks[wday] .. "   " .. nvim_version_info
end

local section_info = {
	type = "text",
	val = get_info(),
	opts = {
		hl = "Comment",
		position = "center",
	}
}

-- dashboard.section.buttons.val = {
--     dashboard.button( "e", "  New file" , "ene <BAR> startinsert <CR>"),
--     dashboard.button( "p", "  Open Projects", "Telescope project"),
-- 	dashboard.button( "s", "  Open Session", "SessionManager load_session" ),
--     dashboard.button( "r", "  Recently opened files"   , "Telescope oldfiles<CR>"),
--     dashboard.button( "f", "  Find file", "cd $HOME/Workspace | Telescope find_files<CR>"),
-- }
-- utils.button("SPC t o", "  Recently opened files"),
-- utils.button("SPC t f", "  Find file"),
-- utils.button("SPC t l", "  Find word"),
-- utils.button("SPC t F", "  File browser"),
-- utils.button("SPC t 1", "  Find repo"),
-- utils.button("SPC t s", "  Open session"),
-- utils.button("SPC c n", "  New file"),
-- utils.button("SPC p u", "  Plugins"),
-- utils.button("q", "  Quit", "<Cmd>qa<CR>"),

local config = {
	layout = {
		-- dashboard.section.terminal,
		section_header,
		{ type = "padding", val = 1 },
		section_shotcuts,
		{ type = "padding", val = 1 },
		section_sessions,
		-- { type = "padding", val = 1 },
		-- section_projects,
		{ type = "padding", val = 2 },
		section_info,
	},
	opts = {
		margin = 5,
		setup = function()
			vim.cmd([[
            autocmd alpha_temp DirChanged * lua require('alpha').redraw()
            ]])
		end,
	},
}


-- alpha.setup(config)
-- alpha.setup(dashboard.opts)

-- Disable folding on alpha buffer
-- vim.cmd([[
--     autocmd FileType alpha setlocal nofoldenable
-- ]])
--

return {
	config = config,
}
